export const pageTitle = 'Исторические даты';
export const titles = ['Технологии', 'Кино', 'Литература', 'Театр', 'Спорт', 'Наука'];
export const stepForYearScrolling = 1;
export const scrollYearsDelay = 500;
export const mobileScreenSize = 1000;

export const arrangementArgs = {
  buttonsAmount: 6,
  circleRadius: 265,
  buttonRadius: 28,
  pointsOnCircle: [
    Math.PI / 3,
    0,
    5 * (Math.PI / 3),
    4 * (Math.PI / 3),
    Math.PI,
    2 * (Math.PI / 3),
  ],
};

export const infoPeriods = [
  {
    id: 1,
    period: {
      start: 1980,
      end: 1986,
    },
    content: [
      {
        year: 1980,
        event: 'Sinclair Research выпускает домашний компьютер ZX80',
      },
      {
        year: 1982,
        event: 'Появился домашний компьютер ZX Spectrum, выпущенный компанией Sinclair Research',
      },
      {
        year: 1983,
        event: 'Компания Compaq Computer Corp. выпустила первый клон компьютера IBM PC',
      },
      {
        year: 1985,
        event: 'Акира Ёсино изготовил прототип литиево-ионного аккумулятора и запатентовал его',
      },
      {
        year: 1986,
        event: 'Компания Compaq выпустила компьютер Deskpro 386 с процессором Intel 386',
      },
    ],
  },
  {
    id: 2,
    period: {
      start: 1987,
      end: 1991,
    },
    content: [
      {
        year: 1987,
        event: '«Хищник»/Predator, США (реж. Джон Мактиран)',
      },
      {
        year: 1988,
        event: '«Кто подставил кролика Роджера»/Who framed Roger rabbit, США (реж. Роберт Земекис)',
      },
      {
        year: 1989,
        event: '«Назад в будущее 2»/Back to the future 2, США (реж. Роберт Земекис)',
      },
      {
        year: 1990,
        event: '«Крепкий орешек 2»/Die hard 2, США (реж. Ренни Харлин)',
      },
      {
        year: 1991,
        event: '«Семейка Аддамс»/The Addams family, США (реж. Барри Зонненфельд)',
      },
    ],
  },
  {
    id: 3,
    period: {
      start: 1992,
      end: 1997,
    },
    content: [
      {
        year: 1992,
        event:
          'Нобелевская премия по литературе — Дерек Уолкотт, «За блестящий образец карибского эпоса в 64 разделах»',
      },
      {
        year: 1994,
        event: '«Бессоница» — роман Стивена Кинга',
      },
      {
        year: 1995,
        event: 'Нобелевская премия по литературе — Шеймас Хини',
      },
      {
        year: 1997,
        event: '«Гарри Поттер и философский камень» — Джоан Роулинг',
      },
    ],
  },
  {
    id: 4,
    period: {
      start: 1999,
      end: 2004,
    },
    content: [
      {
        year: 1999,
        event:
          'Премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона',
      },
      {
        year: 2000,
        event: 'Возобновлено издание журнала «Театр»',
      },
      {
        year: 2002,
        event:
          'Премьера трилогии Тома Стоппарда «Берег утопии», Королевский национальный театр, Лондон',
      },
      {
        year: 2003,
        event: 'В Венеции отреставрировали театр «Ла Фениче», пострадавший при пожаре',
      },
    ],
  },
  {
    id: 5,
    period: {
      start: 2006,
      end: 2014,
    },
    content: [
      {
        year: 2006,
        event: 'С 10 по 26 февраля в Турине прошли XX Зимние Олимпийские игры',
      },
      {
        year: 2008,
        event: 'С 8 по 24 августа в Пекине прошли 29-е летние Олимпийские игры',
      },
      {
        year: 2010,
        event: '13-28 февраля в Ванкувере: XXI Зимние Олимпийские игры 2010 года',
      },
      {
        year: 2012,
        event: '2 августа — Летние Олимпийские игры',
      },
      {
        year: 2014,
        event: 'XXII Зимние Олимпийские игры (Сочи, Россия)',
      },
    ],
  },
  {
    id: 6,
    period: {
      start: 2015,
      end: 2022,
    },
    content: [
      {
        year: 2015,
        event:
          '13 сентября — частичное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 2016,
        event:
          'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        year: 2017,
        event:
          'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        year: 2018,
        event: 'Старт космического аппарата Solar Probe Plus, предназначенного для изучения Солнца',
      },
      {
        year: 2019,
        event: 'Google объявил о создании 53-кубитного квантового компьютера',
      },
      {
        year: 2020,
        event: 'Корабль Crew Dragon вернулся на Землю, после первого пилотного полёта',
      },
    ],
  },
];
